#auther:徐梓豪 2016-12-09
Feature:运营人员配置分类的标签
	"""
		1.运营人员为分类配置标签
	"""

Background:
	Given manager登录系统
	When manager添加商品分类
		"""
		{
			"电子数码": {
				"耳机": null,
				"手机": null,
				"平板电脑": {
					"分类31": null
				}
			},
			"生活用品": {
				"零食": null,
				"肥皂":null,
				"清洁用品": null
			}
		}
		"""
	When manager添加商品标签
		"""
		[{
			"label_group":"国家",
			"label":{
				"美国"，"法国","中国","德国","意大利","澳大利亚"
			}
		},{
			"label_group":"省市",
			"label":{
					"江苏"，"黑龙江","广东","浙江","北京","江西"
			}
		},{
			"label_group":"基本信息",
			"label":{
					"男"，"女","新生儿","9-13岁","14-18岁","成年"
		}]
		"""
	When manager为商品分类'平板电脑'配置标签
		"""
		[{
			"label_group":"国家",
			"label":{
				"美国","法国"
			}
		}]
		"""

	Then manager能获取商品分类列表
		|classfication|     creat_time    | business_number |             operate           |
		|   电子数码  |2016-07-21 15:30:08|      0.00       |修改 删除 配置特殊资质 标签配置|
		|     耳机    |2016-07-21 15:30:25|      0.00       |修改 删除 配置特殊资质 标签配置|
		|     手机    |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 标签配置|
		|   平板电脑  |2016-07-21 15:32:25|      0.00       |修改 删除 配置特殊资质 已配置标签|
		|     分类31  |2016-07-21 15:32:25|      0.00       |修改 删除 配置特殊资质 已配置标签|
		|   生活用品  |2016-07-21 15:31:27|      0.00       |修改 删除 配置特殊资质 标签配置|
		|     零食    |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 标签配置|
		|     肥皂    |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 标签配置|
		|   清洗用品  |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 标签配置|
	Then manager查看商品分类'平板电脑'配置的标签
		"""
		[{
			"label_group":"国家",
			"label":{
				"美国","法国"
			}
		}]
		"""
	Then manager查看商品'分类31'配置的标签
		"""
		[{
			"label_group":"国家",
			"label":{
				"美国","法国"
			}
		}]
		"""

	When manager为商品分类'生活用品'配置标签
	
		"""
		[{
			"label_group":"省市",
			"label":{
				"江苏","黑龙江"
			}
		},{
			"label_group":"基本信息",
			"label":{
				"男","女"
			}
		}]
		"""

	Then manager能获取商品分类列表
		|classfication|     creat_time    | business_number |             operate           |
		|   电子数码  |2016-07-21 15:30:08|      0.00       |修改 删除 配置特殊资质 标签配置|
		|     耳机    |2016-07-21 15:30:25|      0.00       |修改 删除 配置特殊资质 标签配置|
		|     手机    |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 标签配置|
		|   平板电脑  |2016-07-21 15:32:25|      0.00       |修改 删除 配置特殊资质 已配置标签|
		|   生活用品  |2016-07-21 15:31:27|      0.00       |修改 删除 配置特殊资质 已配置标签|
		|     零食    |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 已配置标签|
		|     肥皂    |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 已配置标签|
		|   清洗用品  |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 已配置标签|
	Then manager查看商品分类'肥皂'的标签
		"""
		[{
			"label_group":"省市",
			"label":{
				"江苏","黑龙江"
			}
		},{
			"label_group":"基本信息",
			"label":{
				"男","女"
			}
		}]
		"""
	Then manager为商品分类'零食'配置标签
		"""
		[{
			"label_group":"省市",
			"label":{
				"江苏","黑龙江"
			}
		},{
			"label_group":"基本信息",
			"label":{
				"男","女"
			}
		}]
		"""
	When manager为商品标签'肥皂'配置标签
		"""
		[{
			"label_group":"省市",
			"label":{
				"江苏"
			}
		},{
			"label_group":"基本信息",
			"label":{
				"男"
			}
		}]
		"""
	Then manager查看商品分类'肥皂'的标签
		"""
		[{
			"label_group":"省市",
			"label":{
				"江苏"
			}
		},{
			"label_group":"基本信息",
			"label":{
				"男"
			}
		}]
		"""
	When manager为商品分类'清洗用品'配置标签
		"""
		{
			"label_group":null,
			"label":null
		}
		"""
	Then manager能获取商品分类列表
		|classfication|     creat_time    | business_number |             operate           |
		|   电子数码  |2016-07-21 15:30:08|      0.00       |修改 删除 配置特殊资质 标签配置|
		|     耳机    |2016-07-21 15:30:25|      0.00       |修改 删除 配置特殊资质 标签配置|
		|     手机    |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 标签配置|
		|   平板电脑  |2016-07-21 15:32:25|      0.00       |修改 删除 配置特殊资质 已配置标签|
		|   生活用品  |2016-07-21 15:31:27|      0.00       |修改 删除 配置特殊资质 已配置标签|
		|     零食    |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 已配置标签|
		|     肥皂    |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 标签配置|
		|   清洗用品  |2016-07-21 15:31:25|      0.00       |修改 删除 配置特殊资质 已配置标签|



